const PALETTE_COLORS = [
    "#000000",//（纯黑色）
    "#1A1A1A",
    "#2B2B2B",
    "#333333",
    "#4D4D4D",
    "#666666",
    "#7F7F7F",
    "#999999",
    "#B2B2B2",
    "#CCCCCC",
    "#E5E5E5",
    "#F2F2F2",
    "#F7F7F7",
    "#FBFBFB",
    "#FFFFFF",//（纯白色）

    "#FFCCCC", // 浅红
    "#FF9999", // 红
    "#FF6666", // 深红
    "#FF3333", // 较深红
    "#FF0000", // 最深红

    "#FFCC99", // 浅橙
    "#FF9966", // 橙
    "#FF6633", // 深橙
    "#FF3300", // 较深橙
    "#FF0000", // 最深橙

    "#FFFFCC", // 浅黄
    "#FFFF99", // 黄
    "#FFFF66", // 深黄
    "#FFFF33", // 较深黄
    "#FFFF00", // 最深黄

    "#CCFFCC", // 浅绿
    "#99FF99", // 绿
    "#66FF66", // 深绿
    "#33FF33", // 较深绿
    "#00FF00", // 最深绿

    "#CCFFFF", // 浅青
    "#99FFFF", // 青
    "#66FFFF", // 深青
    "#33FFFF", // 较深青
    "#00FFFF", // 最深青

    "#CCCCFF", // 浅蓝
    "#9999FF", // 蓝
    "#6666FF", // 深蓝
    "#3333FF", // 较深蓝
    "#0000FF", // 最深蓝

    "#FFCCFF", // 浅紫
    "#FF99FF", // 紫
    "#FF66FF", // 深紫
    "#FF33FF", // 较深紫
    "#FF00FF", // 最深紫

    "#FF99CC", // 浅洋红
    "#FF6699", // 洋红
    "#FF3399", // 深洋红
    "#FF0066", // 较深洋红
    "#FF0099", // 最深洋红

    "#FFCCCC", // 浅粉红
    "#FF9999", // 粉红
    "#FF6666", // 深粉红
    "#FF3333", // 较深粉红
    "#FF0000", // 最深粉红

    "#CC99FF", // 浅紫罗兰
    "#9966FF", // 紫罗兰
    "#9933FF", // 深紫罗兰
    "#9900FF", // 较深紫罗兰
    "#9900CC", // 最深紫罗兰

    "#99CCFF", // 浅天蓝
    "#6699FF", // 天蓝
    "#3366FF", // 深天蓝
    "#0066FF", // 较深天蓝
    "#0033FF", // 最深天蓝

    "#99FFCC", // 浅春绿
    "#66FF99", // 春绿
    "#33FF66", // 深春绿
    "#00FF33", // 较深春绿
    "#00FF00", // 最深春绿
]